export const calText = {
  0: `이번주에 섭취한 칼로리 양은 기초대사량보다 적습니다. 너무 적게 먹어 건강에 좋지 않을 수 있습니다.`,
  1: `칼로리 섭취량이 부족하니 적절한 양의 음식을 먹어 체력 유지에 도움을 주세요.`,
  2: `저칼로리 식습관은 건강을 해칠 수 있으니 적절한 양의 음식을 먹어주세요.`,
  3: `사용자의 칼로리 섭취량이 부족한 것으로 보입니다. 균형 잡힌 식습관과 적절한 운동을 통해 체중 증가를 목표로 해야 합니다`,
  4: `잘했습니다! 이번주에 섭취한 칼로리 양은 권장 섭취량과 비슷합니다. 지금처럼 균형 잡힌 식습관을 유지해주세요.`,
  5: `사용자의 칼로리 섭취량과 소비량이 균형 잡혀 있는 것으로 보입니다. 유지하고 있는 체중을 유지하기 위해 규칙적인 식습관과 운동이 필요합니다.`,
  6: `과도한 칼로리 섭취는 건강을 해칠 수 있으니, 적절한 양의 음식을 먹어 균형 잡힌 식습관을 유지해주세요`,
  7: `이번주에 섭취한 칼로리 양이 기초대사량보다 많습니다. 지나치게 섭취하면 체중 증가 등의 문제가 생길 수 있습니다.`,
  8: `다소 많은 칼로리를 섭취했으니, 내일은 조금 더 적은 양을 먹어 균형 잡힌 식습관을 유지해주세요.`,
  9: `사용자의 칼로리 섭취량이 소비량보다 많은 것으로 보입니다. 균형 잡힌 식습관과 운동으로 체중 감량을 목표로 해야 합니다`,
};

export const calText2 = [
  "이번주 섭취칼로리가 목표치보다 적습니다.\n너무 적게 먹어 건강에 좋지 않을 수 있습니다.",
  "칼로리 섭취량이 부족합니다.\n적절한 양의 음식을 먹어 체력 유지에 도움을 주세요.",
  "칼로리 섭취량이 부족합니다.\n저칼로리 식습관은 건강을 해칠 수 있으니\n적절한 양의 음식을 먹어주세요.",
  "사용자의 칼로리 섭취량이 부족합니다.\n균형 잡힌 식습관과 적절한 운동을 통해 체중 증가를 목표로 해야 합니다",
  "잘했습니다!\n이번주에 섭취한 칼로리 양은 적당합니다.\n지금처럼 균형 잡힌 식습관을 유지해주세요.",
  "칼로리 섭취량과 소비량이 균형 잡혀있습니다.\n유지하고 있는 체중을 유지하기 위해 규칙적인 식습관과 운동이 필요합니다.",
  "과도한 칼로리 섭취는 건강을 해칠 수 있으니,\n적절한 양의 음식을 먹어 균형 잡힌 식습관을 유지해주세요",
  "이번주 섭취칼로리가 목표치보다 많습니다.\n지나치게 섭취하면 체중 증가 등의 문제가 생길 수 있습니다.",
  "다소 많은 칼로리를 섭취했으니,\n내일은 조금 더 적은 양을 먹어 균형 잡힌 식습관을 유지해주세요.",
  "칼로리 섭취량이 다소 많습니다.\n균형 잡힌 식습관과 운동으로 체중 감량을\n목표로 해야 합니다",
];

export const nutText = {
  0: `단백질이 너무 많습니다.\n`,
  1: `단백질 섭취가 부족합니다.\n`,
  2: `탄수화물 섭취가 많습니다.\n`,
  3: `탄수화물 섭취가 부족합니다.`,
  4: `지방 섭취가 많습니다.\n`,
  5: `지방 섭취가 부족합니다. \n`,
  6: `콜레스테롤이 너무 많습니다.\n`,
  7: `나트륨이 많습니다.\n`,
  8: `단백질은 적당합니다 \n`,
  9: `탄수화물은 적당합니다 \n`,
  10: `지방이 적당합니다 \n`,
};
