export const calText = {
  0: `이번주에 섭취한 칼로리 양은 기초대사량보다 적습니다. 너무 적게 먹어 건강에 좋지 않을 수 있습니다.`,
  1: `칼로리 섭취량이 부족하니 적절한 양의 음식을 먹어 체력 유지에 도움을 주세요.`,
  2: `저칼로리 식습관은 건강을 해칠 수 있으니 적절한 양의 음식을 먹어주세요.`,
  3: `사용자의 칼로리 섭취량이 부족한 것으로 보입니다. 균형 잡힌 식습관과 적절한 운동을 통해 체중 증가를 목표로 해야 합니다`,
  4: `잘했습니다! 이번주에 섭취한 칼로리 양은 권장 섭취량과 비슷합니다. 지금처럼 균형 잡힌 식습관을 유지해주세요.`,
  5: `사용자의 칼로리 섭취량과 소비량이 균형 잡혀 있는 것으로 보입니다. 유지하고 있는 체중을 유지하기 위해 규칙적인 식습관과 운동이 필요합니다.`,
  6: `과도한 칼로리 섭취는 건강을 해칠 수 있으니, 적절한 양의 음식을 먹어 균형 잡힌 식습관을 유지해주세요`,
  7: `이번주에 섭취한 칼로리 양이 기초대사량보다 많습니다. 지나치게 섭취하면 체중 증가 등의 문제가 생길 수 있습니다.`,
  8: `다소 많은 칼로리를 섭취했으니, 내일은 조금 더 적은 양을 먹어 균형 잡힌 식습관을 유지해주세요.`,
  9: `사용자의 칼로리 섭취량이 소비량보다 많은 것으로 보입니다. 균형 잡힌 식습관과 운동으로 체중 감량을 목표로 해야 합니다`,
};

export const calText2 = [
  "이번주에 섭취한 칼로리 양은 기초대사량보다 적습니다. 너무 적게 먹어 건강에 좋지 않을 수 있습니다.",
  "칼로리 섭취량이 부족하니 적절한 양의 음식을 먹어 체력 유지에 도움을 주세요.",
  "저칼로리 식습관은 건강을 해칠 수 있으니 적절한 양의 음식을 먹어주세요.",
  "사용자의 칼로리 섭취량이 부족한 것으로 보입니다. 균형 잡힌 식습관과 적절한 운동을 통해 체중 증가를 목표로 해야 합니다",
  "잘했습니다! 이번주에 섭취한 칼로리 양은 기초대사량과 같습니다. 지금처럼 균형 잡힌 식습관을 유지해주세요.",
  "사용자의 칼로리 섭취량과 소비량이 균형 잡혀 있는 것으로 보입니다. 유지하고 있는 체중을 유지하기 위해 규칙적인 식습관과 운동이 필요합니다.",
  "과도한 칼로리 섭취는 건강을 해칠 수 있으니, 적절한 양의 음식을 먹어 균형 잡힌 식습관을 유지해주세요",
  "이번주에 섭취한 칼로리 양이 기초대사량보다 많습니다. 지나치게 섭취하면 체중 증가 등의 문제가 생길 수 있습니다.",
  "다소 많은 칼로리를 섭취했으니, 내일은 조금 더 적은 양을 먹어 균형 잡힌 식습관을 유지해주세요.",
  "사용자의 칼로리 섭취량이 소비량보다 많은 것으로 보입니다. 균형 잡힌 식습관과 운동으로 체중 감량을 목표로 해야 합니다",
];

export const nutText = {
  0: `과도한 단백질 섭취는 신장 부담을 초래하고, 뼈 밀도 감소, 심장 질환 등의 건강 문제를 유발할 수 있습니다. 따라서, 권장량을 초과하지 않도록 주의해야 합니다.`,
  1: `단백질은 우리 몸의 조직과 세포 등을 구성하는 주요 성분으로 필수적입니다. 부족한 경우 근육 감소, 면역력 감소, 피로 등의 증상이 나타날 수 있습니다. 따라서, 권장량 이상으로 섭취하며 건강한 식습관을 유지해야 합니다`,
  2: `과다한 탄수화물 섭취는 체중 증가, 인슐린 저항성, 당뇨병 등의 건강 문제를 유발할 수 있습니다. 따라서, 권장량을 초과하지 않도록 주의해야 합니다`,
  3: `탄수화물이 부족한 경우 에너지 부족, 불규칙한 식습관, 신경 쇠약 등의 증상이 나타날 수 있습니다. 따라서, 권장량 이상으로 섭취하며 건강한 식습관을 유지해야 합니다`,
  4: `과다한 지방 섭취는 고지혈증, 동맥경화, 심혈관 질환 등의 건강 문제를 유발할 수 있습니다. 따라서, 권장량을 초과하지 않도록 주의해야 합니다`,
  5: `지방은 우리 몸의 에너지원으로 필수적이며, 비타민 등의 흡수와 유지에도 중요합니다. 부족한 경우 영양 실조, 비만 등의 증상이 나타날 수 있습니다. 따라서, 권장량 이상으로 섭취하며 건강한 식습관을 유지해야 합니다.`,
};
